zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_sg/pic32cx_sg41/include/pio/pic32cx1025sg41080.h
#define PIN_PA14M_GCLK_IO0                         _UINT32_(14)
#define MUX_PA14M_GCLK_IO0                         _UINT32_(12)
#define PINMUX_PA14M_GCLK_IO0                      ((PIN_PA14M_GCLK_IO0 << 16) | MUX_PA14M_GCLK_IO0)
#define PORT_PA14M_GCLK_IO0                        (_UINT32_(1) << 14)

#define PIN_PB22M_GCLK_IO0                         _UINT32_(54)
#define MUX_PB22M_GCLK_IO0                         _UINT32_(12)
#define PINMUX_PB22M_GCLK_IO0                      ((PIN_PB22M_GCLK_IO0 << 16) | MUX_PB22M_GCLK_IO0)
#define PORT_PB22M_GCLK_IO0                        (_UINT32_(1) << 22)

#define PIN_PB15M_GCLK_IO1                         _UINT32_(47)
#define MUX_PB15M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PB15M_GCLK_IO1                      ((PIN_PB15M_GCLK_IO1 << 16) | MUX_PB15M_GCLK_IO1)
#define PORT_PB15M_GCLK_IO1                        (_UINT32_(1) << 15)

#define PIN_PA15M_GCLK_IO1                         _UINT32_(15)
#define MUX_PA15M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PA15M_GCLK_IO1                      ((PIN_PA15M_GCLK_IO1 << 16) | MUX_PA15M_GCLK_IO1)
#define PORT_PA15M_GCLK_IO1                        (_UINT32_(1) << 15)

#define PIN_PB23M_GCLK_IO1                         _UINT32_(55)
#define MUX_PB23M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PB23M_GCLK_IO1                      ((PIN_PB23M_GCLK_IO1 << 16) | MUX_PB23M_GCLK_IO1)
#define PORT_PB23M_GCLK_IO1                        (_UINT32_(1) << 23)

#define PIN_PA27M_GCLK_IO1                         _UINT32_(27)
#define MUX_PA27M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PA27M_GCLK_IO1                      ((PIN_PA27M_GCLK_IO1 << 16) | MUX_PA27M_GCLK_IO1)
#define PORT_PA27M_GCLK_IO1                        (_UINT32_(1) << 27)

#define PIN_PA16M_GCLK_IO2                         _UINT32_(16)
#define MUX_PA16M_GCLK_IO2                         _UINT32_(12)
#define PINMUX_PA16M_GCLK_IO2                      ((PIN_PA16M_GCLK_IO2 << 16) | MUX_PA16M_GCLK_IO2)
#define PORT_PA16M_GCLK_IO2                        (_UINT32_(1) << 16)

#define PIN_PB16M_GCLK_IO2                         _UINT32_(48)
#define MUX_PB16M_GCLK_IO2                         _UINT32_(12)
#define PINMUX_PB16M_GCLK_IO2                      ((PIN_PB16M_GCLK_IO2 << 16) | MUX_PB16M_GCLK_IO2)
#define PORT_PB16M_GCLK_IO2                        (_UINT32_(1) << 16)

#define PIN_PA17M_GCLK_IO3                         _UINT32_(17)
#define MUX_PA17M_GCLK_IO3                         _UINT32_(12)
#define PINMUX_PA17M_GCLK_IO3                      ((PIN_PA17M_GCLK_IO3 << 16) | MUX_PA17M_GCLK_IO3)
#define PORT_PA17M_GCLK_IO3                        (_UINT32_(1) << 17)

#define PIN_PB17M_GCLK_IO3                         _UINT32_(49)
#define MUX_PB17M_GCLK_IO3                         _UINT32_(12)
#define PINMUX_PB17M_GCLK_IO3                      ((PIN_PB17M_GCLK_IO3 << 16) | MUX_PB17M_GCLK_IO3)
#define PORT_PB17M_GCLK_IO3                        (_UINT32_(1) << 17)

#define PIN_PA10M_GCLK_IO4                         _UINT32_(10)
#define MUX_PA10M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PA10M_GCLK_IO4                      ((PIN_PA10M_GCLK_IO4 << 16) | MUX_PA10M_GCLK_IO4)
#define PORT_PA10M_GCLK_IO4                        (_UINT32_(1) << 10)

#define PIN_PB10M_GCLK_IO4                         _UINT32_(42)
#define MUX_PB10M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PB10M_GCLK_IO4                      ((PIN_PB10M_GCLK_IO4 << 16) | MUX_PB10M_GCLK_IO4)
#define PORT_PB10M_GCLK_IO4                        (_UINT32_(1) << 10)

#define PIN_PB18M_GCLK_IO4                         _UINT32_(50)
#define MUX_PB18M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PB18M_GCLK_IO4                      ((PIN_PB18M_GCLK_IO4 << 16) | MUX_PB18M_GCLK_IO4)
#define PORT_PB18M_GCLK_IO4                        (_UINT32_(1) << 18)

#define PIN_PA11M_GCLK_IO5                         _UINT32_(11)
#define MUX_PA11M_GCLK_IO5                         _UINT32_(12)
#define PINMUX_PA11M_GCLK_IO5                      ((PIN_PA11M_GCLK_IO5 << 16) | MUX_PA11M_GCLK_IO5)
#define PORT_PA11M_GCLK_IO5                        (_UINT32_(1) << 11)

#define PIN_PB11M_GCLK_IO5                         _UINT32_(43)
#define MUX_PB11M_GCLK_IO5                         _UINT32_(12)
#define PINMUX_PB11M_GCLK_IO5                      ((PIN_PB11M_GCLK_IO5 << 16) | MUX_PB11M_GCLK_IO5)
#define PORT_PB11M_GCLK_IO5                        (_UINT32_(1) << 11)

#define PIN_PB19M_GCLK_IO5                         _UINT32_(51)
#define MUX_PB19M_GCLK_IO5                         _UINT32_(12)
#define PINMUX_PB19M_GCLK_IO5                      ((PIN_PB19M_GCLK_IO5 << 16) | MUX_PB19M_GCLK_IO5)
#define PORT_PB19M_GCLK_IO5                        (_UINT32_(1) << 19)

#define PIN_PB12M_GCLK_IO6                         _UINT32_(44)
#define MUX_PB12M_GCLK_IO6                         _UINT32_(12)
#define PINMUX_PB12M_GCLK_IO6                      ((PIN_PB12M_GCLK_IO6 << 16) | MUX_PB12M_GCLK_IO6)
#define PORT_PB12M_GCLK_IO6                        (_UINT32_(1) << 12)

#define PIN_PB20M_GCLK_IO6                         _UINT32_(52)
#define MUX_PB20M_GCLK_IO6                         _UINT32_(12)
#define PINMUX_PB20M_GCLK_IO6                      ((PIN_PB20M_GCLK_IO6 << 16) | MUX_PB20M_GCLK_IO6)
#define PORT_PB20M_GCLK_IO6                        (_UINT32_(1) << 20)

#define PIN_PB13M_GCLK_IO7                         _UINT32_(45)
#define MUX_PB13M_GCLK_IO7                         _UINT32_(12)
#define PINMUX_PB13M_GCLK_IO7                      ((PIN_PB13M_GCLK_IO7 << 16) | MUX_PB13M_GCLK_IO7)
#define PORT_PB13M_GCLK_IO7                        (_UINT32_(1) << 13)

#define PIN_PB21M_GCLK_IO7                         _UINT32_(53)
#define MUX_PB21M_GCLK_IO7                         _UINT32_(12)
#define PINMUX_PB21M_GCLK_IO7                      ((PIN_PB21M_GCLK_IO7 << 16) | MUX_PB21M_GCLK_IO7)
#define PORT_PB21M_GCLK_IO7                        (_UINT32_(1) << 21)

