zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_sg/pic32cx_sg41/include/pio/pic32cx1025sg41080.h
/* ================== PORT definition for GMAC peripheral =================== */
#define PIN_PA16L_GMAC_GCRS                        _UINT32_(16)
#define MUX_PA16L_GMAC_GCRS                        _UINT32_(11)
#define PINMUX_PA16L_GMAC_GCRS                     ((PIN_PA16L_GMAC_GCRS << 16) | MUX_PA16L_GMAC_GCRS)
#define PORT_PA16L_GMAC_GCRS                       (_UINT32_(1) << 16)

#define PIN_PA20L_GMAC_GMDC                        _UINT32_(20)
#define MUX_PA20L_GMAC_GMDC                        _UINT32_(11)
#define PINMUX_PA20L_GMAC_GMDC                     ((PIN_PA20L_GMAC_GMDC << 16) | MUX_PA20L_GMAC_GMDC)
#define PORT_PA20L_GMAC_GMDC                       (_UINT32_(1) << 20)

#define PIN_PB14L_GMAC_GMDC                        _UINT32_(46)
#define MUX_PB14L_GMAC_GMDC                        _UINT32_(11)
#define PINMUX_PB14L_GMAC_GMDC                     ((PIN_PB14L_GMAC_GMDC << 16) | MUX_PB14L_GMAC_GMDC)
#define PORT_PB14L_GMAC_GMDC                       (_UINT32_(1) << 14)

#define PIN_PA21L_GMAC_GMDIO                       _UINT32_(21)
#define MUX_PA21L_GMAC_GMDIO                       _UINT32_(11)
#define PINMUX_PA21L_GMAC_GMDIO                    ((PIN_PA21L_GMAC_GMDIO << 16) | MUX_PA21L_GMAC_GMDIO)
#define PORT_PA21L_GMAC_GMDIO                      (_UINT32_(1) << 21)

#define PIN_PB15L_GMAC_GMDIO                       _UINT32_(47)
#define MUX_PB15L_GMAC_GMDIO                       _UINT32_(11)
#define PINMUX_PB15L_GMAC_GMDIO                    ((PIN_PB15L_GMAC_GMDIO << 16) | MUX_PB15L_GMAC_GMDIO)
#define PORT_PB15L_GMAC_GMDIO                      (_UINT32_(1) << 15)

#define PIN_PC12L_GMAC_GMDIO                       _UINT32_(76)
#define MUX_PC12L_GMAC_GMDIO                       _UINT32_(11)
#define PINMUX_PC12L_GMAC_GMDIO                    ((PIN_PC12L_GMAC_GMDIO << 16) | MUX_PC12L_GMAC_GMDIO)
#define PORT_PC12L_GMAC_GMDIO                      (_UINT32_(1) << 12)

#define PIN_PA13L_GMAC_GRX0                        _UINT32_(13)
#define MUX_PA13L_GMAC_GRX0                        _UINT32_(11)
#define PINMUX_PA13L_GMAC_GRX0                     ((PIN_PA13L_GMAC_GRX0 << 16) | MUX_PA13L_GMAC_GRX0)
#define PORT_PA13L_GMAC_GRX0                       (_UINT32_(1) << 13)

#define PIN_PA12L_GMAC_GRX1                        _UINT32_(12)
#define MUX_PA12L_GMAC_GRX1                        _UINT32_(11)
#define PINMUX_PA12L_GMAC_GRX1                     ((PIN_PA12L_GMAC_GRX1 << 16) | MUX_PA12L_GMAC_GRX1)
#define PORT_PA12L_GMAC_GRX1                       (_UINT32_(1) << 12)

#define PIN_PC15L_GMAC_GRX2                        _UINT32_(79)
#define MUX_PC15L_GMAC_GRX2                        _UINT32_(11)
#define PINMUX_PC15L_GMAC_GRX2                     ((PIN_PC15L_GMAC_GRX2 << 16) | MUX_PC15L_GMAC_GRX2)
#define PORT_PC15L_GMAC_GRX2                       (_UINT32_(1) << 15)

#define PIN_PC14L_GMAC_GRX3                        _UINT32_(78)
#define MUX_PC14L_GMAC_GRX3                        _UINT32_(11)
#define PINMUX_PC14L_GMAC_GRX3                     ((PIN_PC14L_GMAC_GRX3 << 16) | MUX_PC14L_GMAC_GRX3)
#define PORT_PC14L_GMAC_GRX3                       (_UINT32_(1) << 14)

#define PIN_PA15L_GMAC_GRXER                       _UINT32_(15)
#define MUX_PA15L_GMAC_GRXER                       _UINT32_(11)
#define PINMUX_PA15L_GMAC_GRXER                    ((PIN_PA15L_GMAC_GRXER << 16) | MUX_PA15L_GMAC_GRXER)
#define PORT_PA15L_GMAC_GRXER                      (_UINT32_(1) << 15)

#define PIN_PA18L_GMAC_GTX0                        _UINT32_(18)
#define MUX_PA18L_GMAC_GTX0                        _UINT32_(11)
#define PINMUX_PA18L_GMAC_GTX0                     ((PIN_PA18L_GMAC_GTX0 << 16) | MUX_PA18L_GMAC_GTX0)
#define PORT_PA18L_GMAC_GTX0                       (_UINT32_(1) << 18)

#define PIN_PA19L_GMAC_GTX1                        _UINT32_(19)
#define MUX_PA19L_GMAC_GTX1                        _UINT32_(11)
#define PINMUX_PA19L_GMAC_GTX1                     ((PIN_PA19L_GMAC_GTX1 << 16) | MUX_PA19L_GMAC_GTX1)
#define PORT_PA19L_GMAC_GTX1                       (_UINT32_(1) << 19)

#define PIN_PC16L_GMAC_GTX2                        _UINT32_(80)
#define MUX_PC16L_GMAC_GTX2                        _UINT32_(11)
#define PINMUX_PC16L_GMAC_GTX2                     ((PIN_PC16L_GMAC_GTX2 << 16) | MUX_PC16L_GMAC_GTX2)
#define PORT_PC16L_GMAC_GTX2                       (_UINT32_(1) << 16)

#define PIN_PC17L_GMAC_GTX3                        _UINT32_(81)
#define MUX_PC17L_GMAC_GTX3                        _UINT32_(11)
#define PINMUX_PC17L_GMAC_GTX3                     ((PIN_PC17L_GMAC_GTX3 << 16) | MUX_PC17L_GMAC_GTX3)
#define PORT_PC17L_GMAC_GTX3                       (_UINT32_(1) << 17)

#define PIN_PA14L_GMAC_GTXCK                       _UINT32_(14)
#define MUX_PA14L_GMAC_GTXCK                       _UINT32_(11)
#define PINMUX_PA14L_GMAC_GTXCK                    ((PIN_PA14L_GMAC_GTXCK << 16) | MUX_PA14L_GMAC_GTXCK)
#define PORT_PA14L_GMAC_GTXCK                      (_UINT32_(1) << 14)

#define PIN_PA17L_GMAC_GTXEN                       _UINT32_(17)
#define MUX_PA17L_GMAC_GTXEN                       _UINT32_(11)
#define PINMUX_PA17L_GMAC_GTXEN                    ((PIN_PA17L_GMAC_GTXEN << 16) | MUX_PA17L_GMAC_GTXEN)
#define PORT_PA17L_GMAC_GTXEN                      (_UINT32_(1) << 17)

/* =================== PORT definition for I2S peripheral =================== */
#define PIN_PA09J_I2S_FS0                          _UINT32_(9) 
#define MUX_PA09J_I2S_FS0                          _UINT32_(9) 
#define PINMUX_PA09J_I2S_FS0                       ((PIN_PA09J_I2S_FS0 << 16) | MUX_PA09J_I2S_FS0)
#define PORT_PA09J_I2S_FS0                         (_UINT32_(1) << 9)

#define PIN_PA20J_I2S_FS0                          _UINT32_(20)
#define MUX_PA20J_I2S_FS0                          _UINT32_(9) 
#define PINMUX_PA20J_I2S_FS0                       ((PIN_PA20J_I2S_FS0 << 16) | MUX_PA20J_I2S_FS0)
#define PORT_PA20J_I2S_FS0                         (_UINT32_(1) << 20)

#define PIN_PA23J_I2S_FS1                          _UINT32_(23)
#define MUX_PA23J_I2S_FS1                          _UINT32_(9) 
#define PINMUX_PA23J_I2S_FS1                       ((PIN_PA23J_I2S_FS1 << 16) | MUX_PA23J_I2S_FS1)
#define PORT_PA23J_I2S_FS1                         (_UINT32_(1) << 23)

#define PIN_PB11J_I2S_FS1                          _UINT32_(43)
#define MUX_PB11J_I2S_FS1                          _UINT32_(9) 
#define PINMUX_PB11J_I2S_FS1                       ((PIN_PB11J_I2S_FS1 << 16) | MUX_PB11J_I2S_FS1)
#define PORT_PB11J_I2S_FS1                         (_UINT32_(1) << 11)

#define PIN_PA08J_I2S_MCK0                         _UINT32_(8) 
#define MUX_PA08J_I2S_MCK0                         _UINT32_(9) 
#define PINMUX_PA08J_I2S_MCK0                      ((PIN_PA08J_I2S_MCK0 << 16) | MUX_PA08J_I2S_MCK0)
#define PORT_PA08J_I2S_MCK0                        (_UINT32_(1) << 8)

#define PIN_PB17J_I2S_MCK0                         _UINT32_(49)
#define MUX_PB17J_I2S_MCK0                         _UINT32_(9) 
#define PINMUX_PB17J_I2S_MCK0                      ((PIN_PB17J_I2S_MCK0 << 16) | MUX_PB17J_I2S_MCK0)
#define PORT_PB17J_I2S_MCK0                        (_UINT32_(1) << 17)

#define PIN_PB13J_I2S_MCK1                         _UINT32_(45)
#define MUX_PB13J_I2S_MCK1                         _UINT32_(9) 
#define PINMUX_PB13J_I2S_MCK1                      ((PIN_PB13J_I2S_MCK1 << 16) | MUX_PB13J_I2S_MCK1)
#define PORT_PB13J_I2S_MCK1                        (_UINT32_(1) << 13)

