zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_sg/pic32cx_sg41/include/pio/pic32cx1025sg41080.h
#define PIN_PA10J_I2S_SCK0                         _UINT32_(10)
#define MUX_PA10J_I2S_SCK0                         _UINT32_(9) 
#define PINMUX_PA10J_I2S_SCK0                      ((PIN_PA10J_I2S_SCK0 << 16) | MUX_PA10J_I2S_SCK0)
#define PORT_PA10J_I2S_SCK0                        (_UINT32_(1) << 10)

#define PIN_PB16J_I2S_SCK0                         _UINT32_(48)
#define MUX_PB16J_I2S_SCK0                         _UINT32_(9) 
#define PINMUX_PB16J_I2S_SCK0                      ((PIN_PB16J_I2S_SCK0 << 16) | MUX_PB16J_I2S_SCK0)
#define PORT_PB16J_I2S_SCK0                        (_UINT32_(1) << 16)

#define PIN_PB12J_I2S_SCK1                         _UINT32_(44)
#define MUX_PB12J_I2S_SCK1                         _UINT32_(9) 
#define PINMUX_PB12J_I2S_SCK1                      ((PIN_PB12J_I2S_SCK1 << 16) | MUX_PB12J_I2S_SCK1)
#define PORT_PB12J_I2S_SCK1                        (_UINT32_(1) << 12)

#define PIN_PA22J_I2S_SDI                          _UINT32_(22)
#define MUX_PA22J_I2S_SDI                          _UINT32_(9) 
#define PINMUX_PA22J_I2S_SDI                       ((PIN_PA22J_I2S_SDI << 16) | MUX_PA22J_I2S_SDI)
#define PORT_PA22J_I2S_SDI                         (_UINT32_(1) << 22)

#define PIN_PB10J_I2S_SDI                          _UINT32_(42)
#define MUX_PB10J_I2S_SDI                          _UINT32_(9) 
#define PINMUX_PB10J_I2S_SDI                       ((PIN_PB10J_I2S_SDI << 16) | MUX_PB10J_I2S_SDI)
#define PORT_PB10J_I2S_SDI                         (_UINT32_(1) << 10)

#define PIN_PA11J_I2S_SDO                          _UINT32_(11)
#define MUX_PA11J_I2S_SDO                          _UINT32_(9) 
#define PINMUX_PA11J_I2S_SDO                       ((PIN_PA11J_I2S_SDO << 16) | MUX_PA11J_I2S_SDO)
#define PORT_PA11J_I2S_SDO                         (_UINT32_(1) << 11)

#define PIN_PA21J_I2S_SDO                          _UINT32_(21)
#define MUX_PA21J_I2S_SDO                          _UINT32_(9) 
#define PINMUX_PA21J_I2S_SDO                       ((PIN_PA21J_I2S_SDO << 16) | MUX_PA21J_I2S_SDO)
#define PORT_PA21J_I2S_SDO                         (_UINT32_(1) << 21)

/* =================== PORT definition for PCC peripheral =================== */
#define PIN_PA14K_PCC_CLK                          _UINT32_(14)
#define MUX_PA14K_PCC_CLK                          _UINT32_(10)
#define PINMUX_PA14K_PCC_CLK                       ((PIN_PA14K_PCC_CLK << 16) | MUX_PA14K_PCC_CLK)
#define PORT_PA14K_PCC_CLK                         (_UINT32_(1) << 14)

#define PIN_PA16K_PCC_DATA0                        _UINT32_(16)
#define MUX_PA16K_PCC_DATA0                        _UINT32_(10)
#define PINMUX_PA16K_PCC_DATA0                     ((PIN_PA16K_PCC_DATA0 << 16) | MUX_PA16K_PCC_DATA0)
#define PORT_PA16K_PCC_DATA0                       (_UINT32_(1) << 16)

#define PIN_PA17K_PCC_DATA1                        _UINT32_(17)
#define MUX_PA17K_PCC_DATA1                        _UINT32_(10)
#define PINMUX_PA17K_PCC_DATA1                     ((PIN_PA17K_PCC_DATA1 << 16) | MUX_PA17K_PCC_DATA1)
#define PORT_PA17K_PCC_DATA1                       (_UINT32_(1) << 17)

#define PIN_PA18K_PCC_DATA2                        _UINT32_(18)
#define MUX_PA18K_PCC_DATA2                        _UINT32_(10)
#define PINMUX_PA18K_PCC_DATA2                     ((PIN_PA18K_PCC_DATA2 << 16) | MUX_PA18K_PCC_DATA2)
#define PORT_PA18K_PCC_DATA2                       (_UINT32_(1) << 18)

#define PIN_PA19K_PCC_DATA3                        _UINT32_(19)
#define MUX_PA19K_PCC_DATA3                        _UINT32_(10)
#define PINMUX_PA19K_PCC_DATA3                     ((PIN_PA19K_PCC_DATA3 << 16) | MUX_PA19K_PCC_DATA3)
#define PORT_PA19K_PCC_DATA3                       (_UINT32_(1) << 19)

#define PIN_PA20K_PCC_DATA4                        _UINT32_(20)
#define MUX_PA20K_PCC_DATA4                        _UINT32_(10)
#define PINMUX_PA20K_PCC_DATA4                     ((PIN_PA20K_PCC_DATA4 << 16) | MUX_PA20K_PCC_DATA4)
#define PORT_PA20K_PCC_DATA4                       (_UINT32_(1) << 20)

#define PIN_PA21K_PCC_DATA5                        _UINT32_(21)
#define MUX_PA21K_PCC_DATA5                        _UINT32_(10)
#define PINMUX_PA21K_PCC_DATA5                     ((PIN_PA21K_PCC_DATA5 << 16) | MUX_PA21K_PCC_DATA5)
#define PORT_PA21K_PCC_DATA5                       (_UINT32_(1) << 21)

#define PIN_PA22K_PCC_DATA6                        _UINT32_(22)
#define MUX_PA22K_PCC_DATA6                        _UINT32_(10)
#define PINMUX_PA22K_PCC_DATA6                     ((PIN_PA22K_PCC_DATA6 << 16) | MUX_PA22K_PCC_DATA6)
#define PORT_PA22K_PCC_DATA6                       (_UINT32_(1) << 22)

#define PIN_PA23K_PCC_DATA7                        _UINT32_(23)
#define MUX_PA23K_PCC_DATA7                        _UINT32_(10)
#define PINMUX_PA23K_PCC_DATA7                     ((PIN_PA23K_PCC_DATA7 << 16) | MUX_PA23K_PCC_DATA7)
#define PORT_PA23K_PCC_DATA7                       (_UINT32_(1) << 23)

#define PIN_PB14K_PCC_DATA8                        _UINT32_(46)
#define MUX_PB14K_PCC_DATA8                        _UINT32_(10)
#define PINMUX_PB14K_PCC_DATA8                     ((PIN_PB14K_PCC_DATA8 << 16) | MUX_PB14K_PCC_DATA8)
#define PORT_PB14K_PCC_DATA8                       (_UINT32_(1) << 14)

#define PIN_PB15K_PCC_DATA9                        _UINT32_(47)
#define MUX_PB15K_PCC_DATA9                        _UINT32_(10)
#define PINMUX_PB15K_PCC_DATA9                     ((PIN_PB15K_PCC_DATA9 << 16) | MUX_PB15K_PCC_DATA9)
#define PORT_PB15K_PCC_DATA9                       (_UINT32_(1) << 15)

#define PIN_PC12K_PCC_DATA10                       _UINT32_(76)
#define MUX_PC12K_PCC_DATA10                       _UINT32_(10)
#define PINMUX_PC12K_PCC_DATA10                    ((PIN_PC12K_PCC_DATA10 << 16) | MUX_PC12K_PCC_DATA10)
#define PORT_PC12K_PCC_DATA10                      (_UINT32_(1) << 12)

#define PIN_PC13K_PCC_DATA11                       _UINT32_(77)
#define MUX_PC13K_PCC_DATA11                       _UINT32_(10)
#define PINMUX_PC13K_PCC_DATA11                    ((PIN_PC13K_PCC_DATA11 << 16) | MUX_PC13K_PCC_DATA11)
#define PORT_PC13K_PCC_DATA11                      (_UINT32_(1) << 13)

#define PIN_PC14K_PCC_DATA12                       _UINT32_(78)
#define MUX_PC14K_PCC_DATA12                       _UINT32_(10)
#define PINMUX_PC14K_PCC_DATA12                    ((PIN_PC14K_PCC_DATA12 << 16) | MUX_PC14K_PCC_DATA12)
#define PORT_PC14K_PCC_DATA12                      (_UINT32_(1) << 14)

#define PIN_PC15K_PCC_DATA13                       _UINT32_(79)
#define MUX_PC15K_PCC_DATA13                       _UINT32_(10)
#define PINMUX_PC15K_PCC_DATA13                    ((PIN_PC15K_PCC_DATA13 << 16) | MUX_PC15K_PCC_DATA13)
#define PORT_PC15K_PCC_DATA13                      (_UINT32_(1) << 15)

#define PIN_PA12K_PCC_DEN1                         _UINT32_(12)
#define MUX_PA12K_PCC_DEN1                         _UINT32_(10)
#define PINMUX_PA12K_PCC_DEN1                      ((PIN_PA12K_PCC_DEN1 << 16) | MUX_PA12K_PCC_DEN1)
#define PORT_PA12K_PCC_DEN1                        (_UINT32_(1) << 12)

