zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_sg/pic32cx_sg41/include/pio/pic32cx1025sg41080.h
#define PIN_PA13K_PCC_DEN2                         _UINT32_(13)
#define MUX_PA13K_PCC_DEN2                         _UINT32_(10)
#define PINMUX_PA13K_PCC_DEN2                      ((PIN_PA13K_PCC_DEN2 << 16) | MUX_PA13K_PCC_DEN2)
#define PORT_PA13K_PCC_DEN2                        (_UINT32_(1) << 13)

/* ================== PORT definition for PDEC peripheral =================== */
#define PIN_PB18G_PDEC_QDI0                        _UINT32_(50)
#define MUX_PB18G_PDEC_QDI0                        _UINT32_(6) 
#define PINMUX_PB18G_PDEC_QDI0                     ((PIN_PB18G_PDEC_QDI0 << 16) | MUX_PB18G_PDEC_QDI0)
#define PORT_PB18G_PDEC_QDI0                       (_UINT32_(1) << 18)

#define PIN_PB23G_PDEC_QDI0                        _UINT32_(55)
#define MUX_PB23G_PDEC_QDI0                        _UINT32_(6) 
#define PINMUX_PB23G_PDEC_QDI0                     ((PIN_PB23G_PDEC_QDI0 << 16) | MUX_PB23G_PDEC_QDI0)
#define PORT_PB23G_PDEC_QDI0                       (_UINT32_(1) << 23)

#define PIN_PC16G_PDEC_QDI0                        _UINT32_(80)
#define MUX_PC16G_PDEC_QDI0                        _UINT32_(6) 
#define PINMUX_PC16G_PDEC_QDI0                     ((PIN_PC16G_PDEC_QDI0 << 16) | MUX_PC16G_PDEC_QDI0)
#define PORT_PC16G_PDEC_QDI0                       (_UINT32_(1) << 16)

#define PIN_PA24G_PDEC_QDI0                        _UINT32_(24)
#define MUX_PA24G_PDEC_QDI0                        _UINT32_(6) 
#define PINMUX_PA24G_PDEC_QDI0                     ((PIN_PA24G_PDEC_QDI0 << 16) | MUX_PA24G_PDEC_QDI0)
#define PORT_PA24G_PDEC_QDI0                       (_UINT32_(1) << 24)

#define PIN_PB19G_PDEC_QDI1                        _UINT32_(51)
#define MUX_PB19G_PDEC_QDI1                        _UINT32_(6) 
#define PINMUX_PB19G_PDEC_QDI1                     ((PIN_PB19G_PDEC_QDI1 << 16) | MUX_PB19G_PDEC_QDI1)
#define PORT_PB19G_PDEC_QDI1                       (_UINT32_(1) << 19)

#define PIN_PC17G_PDEC_QDI1                        _UINT32_(81)
#define MUX_PC17G_PDEC_QDI1                        _UINT32_(6) 
#define PINMUX_PC17G_PDEC_QDI1                     ((PIN_PC17G_PDEC_QDI1 << 16) | MUX_PC17G_PDEC_QDI1)
#define PORT_PC17G_PDEC_QDI1                       (_UINT32_(1) << 17)

#define PIN_PA25G_PDEC_QDI1                        _UINT32_(25)
#define MUX_PA25G_PDEC_QDI1                        _UINT32_(6) 
#define PINMUX_PA25G_PDEC_QDI1                     ((PIN_PA25G_PDEC_QDI1 << 16) | MUX_PA25G_PDEC_QDI1)
#define PORT_PA25G_PDEC_QDI1                       (_UINT32_(1) << 25)

#define PIN_PB20G_PDEC_QDI2                        _UINT32_(52)
#define MUX_PB20G_PDEC_QDI2                        _UINT32_(6) 
#define PINMUX_PB20G_PDEC_QDI2                     ((PIN_PB20G_PDEC_QDI2 << 16) | MUX_PB20G_PDEC_QDI2)
#define PORT_PB20G_PDEC_QDI2                       (_UINT32_(1) << 20)

#define PIN_PB22G_PDEC_QDI2                        _UINT32_(54)
#define MUX_PB22G_PDEC_QDI2                        _UINT32_(6) 
#define PINMUX_PB22G_PDEC_QDI2                     ((PIN_PB22G_PDEC_QDI2 << 16) | MUX_PB22G_PDEC_QDI2)
#define PORT_PB22G_PDEC_QDI2                       (_UINT32_(1) << 22)

/* ================== PORT definition for QSPI peripheral =================== */
#define PIN_PB11H_QSPI_CS                          _UINT32_(43)
#define MUX_PB11H_QSPI_CS                          _UINT32_(7) 
#define PINMUX_PB11H_QSPI_CS                       ((PIN_PB11H_QSPI_CS << 16) | MUX_PB11H_QSPI_CS)
#define PORT_PB11H_QSPI_CS                         (_UINT32_(1) << 11)

#define PIN_PA08H_QSPI_DATA0                       _UINT32_(8) 
#define MUX_PA08H_QSPI_DATA0                       _UINT32_(7) 
#define PINMUX_PA08H_QSPI_DATA0                    ((PIN_PA08H_QSPI_DATA0 << 16) | MUX_PA08H_QSPI_DATA0)
#define PORT_PA08H_QSPI_DATA0                      (_UINT32_(1) << 8)

#define PIN_PA09H_QSPI_DATA1                       _UINT32_(9) 
#define MUX_PA09H_QSPI_DATA1                       _UINT32_(7) 
#define PINMUX_PA09H_QSPI_DATA1                    ((PIN_PA09H_QSPI_DATA1 << 16) | MUX_PA09H_QSPI_DATA1)
#define PORT_PA09H_QSPI_DATA1                      (_UINT32_(1) << 9)

#define PIN_PA10H_QSPI_DATA2                       _UINT32_(10)
#define MUX_PA10H_QSPI_DATA2                       _UINT32_(7) 
#define PINMUX_PA10H_QSPI_DATA2                    ((PIN_PA10H_QSPI_DATA2 << 16) | MUX_PA10H_QSPI_DATA2)
#define PORT_PA10H_QSPI_DATA2                      (_UINT32_(1) << 10)

#define PIN_PA11H_QSPI_DATA3                       _UINT32_(11)
#define MUX_PA11H_QSPI_DATA3                       _UINT32_(7) 
#define PINMUX_PA11H_QSPI_DATA3                    ((PIN_PA11H_QSPI_DATA3 << 16) | MUX_PA11H_QSPI_DATA3)
#define PORT_PA11H_QSPI_DATA3                      (_UINT32_(1) << 11)

#define PIN_PB10H_QSPI_SCK                         _UINT32_(42)
#define MUX_PB10H_QSPI_SCK                         _UINT32_(7) 
#define PINMUX_PB10H_QSPI_SCK                      ((PIN_PB10H_QSPI_SCK << 16) | MUX_PB10H_QSPI_SCK)
#define PORT_PB10H_QSPI_SCK                        (_UINT32_(1) << 10)

/* ================== PORT definition for SDHC0 peripheral ================== */
#define PIN_PA06I_SDHC0_SDCD                       _UINT32_(6) 
#define MUX_PA06I_SDHC0_SDCD                       _UINT32_(8) 
#define PINMUX_PA06I_SDHC0_SDCD                    ((PIN_PA06I_SDHC0_SDCD << 16) | MUX_PA06I_SDHC0_SDCD)
#define PORT_PA06I_SDHC0_SDCD                      (_UINT32_(1) << 6)

#define PIN_PA12I_SDHC0_SDCD                       _UINT32_(12)
#define MUX_PA12I_SDHC0_SDCD                       _UINT32_(8) 
#define PINMUX_PA12I_SDHC0_SDCD                    ((PIN_PA12I_SDHC0_SDCD << 16) | MUX_PA12I_SDHC0_SDCD)
#define PORT_PA12I_SDHC0_SDCD                      (_UINT32_(1) << 12)

#define PIN_PB12I_SDHC0_SDCD                       _UINT32_(44)
#define MUX_PB12I_SDHC0_SDCD                       _UINT32_(8) 
#define PINMUX_PB12I_SDHC0_SDCD                    ((PIN_PB12I_SDHC0_SDCD << 16) | MUX_PB12I_SDHC0_SDCD)
#define PORT_PB12I_SDHC0_SDCD                      (_UINT32_(1) << 12)

