zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_sg/pic32cx_sg41/include/pio/pic32cx1025sg41080.h
#define PIN_PC06I_SDHC0_SDCD                       _UINT32_(70)
#define MUX_PC06I_SDHC0_SDCD                       _UINT32_(8) 
#define PINMUX_PC06I_SDHC0_SDCD                    ((PIN_PC06I_SDHC0_SDCD << 16) | MUX_PC06I_SDHC0_SDCD)
#define PORT_PC06I_SDHC0_SDCD                      (_UINT32_(1) << 6)

#define PIN_PB11I_SDHC0_SDCK                       _UINT32_(43)
#define MUX_PB11I_SDHC0_SDCK                       _UINT32_(8) 
#define PINMUX_PB11I_SDHC0_SDCK                    ((PIN_PB11I_SDHC0_SDCK << 16) | MUX_PB11I_SDHC0_SDCK)
#define PORT_PB11I_SDHC0_SDCK                      (_UINT32_(1) << 11)

#define PIN_PA08I_SDHC0_SDCMD                      _UINT32_(8) 
#define MUX_PA08I_SDHC0_SDCMD                      _UINT32_(8) 
#define PINMUX_PA08I_SDHC0_SDCMD                   ((PIN_PA08I_SDHC0_SDCMD << 16) | MUX_PA08I_SDHC0_SDCMD)
#define PORT_PA08I_SDHC0_SDCMD                     (_UINT32_(1) << 8)

#define PIN_PA09I_SDHC0_SDDAT0                     _UINT32_(9) 
#define MUX_PA09I_SDHC0_SDDAT0                     _UINT32_(8) 
#define PINMUX_PA09I_SDHC0_SDDAT0                  ((PIN_PA09I_SDHC0_SDDAT0 << 16) | MUX_PA09I_SDHC0_SDDAT0)
#define PORT_PA09I_SDHC0_SDDAT0                    (_UINT32_(1) << 9)

#define PIN_PA10I_SDHC0_SDDAT1                     _UINT32_(10)
#define MUX_PA10I_SDHC0_SDDAT1                     _UINT32_(8) 
#define PINMUX_PA10I_SDHC0_SDDAT1                  ((PIN_PA10I_SDHC0_SDDAT1 << 16) | MUX_PA10I_SDHC0_SDDAT1)
#define PORT_PA10I_SDHC0_SDDAT1                    (_UINT32_(1) << 10)

#define PIN_PA11I_SDHC0_SDDAT2                     _UINT32_(11)
#define MUX_PA11I_SDHC0_SDDAT2                     _UINT32_(8) 
#define PINMUX_PA11I_SDHC0_SDDAT2                  ((PIN_PA11I_SDHC0_SDDAT2 << 16) | MUX_PA11I_SDHC0_SDDAT2)
#define PORT_PA11I_SDHC0_SDDAT2                    (_UINT32_(1) << 11)

#define PIN_PB10I_SDHC0_SDDAT3                     _UINT32_(42)
#define MUX_PB10I_SDHC0_SDDAT3                     _UINT32_(8) 
#define PINMUX_PB10I_SDHC0_SDDAT3                  ((PIN_PB10I_SDHC0_SDDAT3 << 16) | MUX_PB10I_SDHC0_SDDAT3)
#define PORT_PB10I_SDHC0_SDDAT3                    (_UINT32_(1) << 10)

#define PIN_PA07I_SDHC0_SDWP                       _UINT32_(7) 
#define MUX_PA07I_SDHC0_SDWP                       _UINT32_(8) 
#define PINMUX_PA07I_SDHC0_SDWP                    ((PIN_PA07I_SDHC0_SDWP << 16) | MUX_PA07I_SDHC0_SDWP)
#define PORT_PA07I_SDHC0_SDWP                      (_UINT32_(1) << 7)

#define PIN_PA13I_SDHC0_SDWP                       _UINT32_(13)
#define MUX_PA13I_SDHC0_SDWP                       _UINT32_(8) 
#define PINMUX_PA13I_SDHC0_SDWP                    ((PIN_PA13I_SDHC0_SDWP << 16) | MUX_PA13I_SDHC0_SDWP)
#define PORT_PA13I_SDHC0_SDWP                      (_UINT32_(1) << 13)

#define PIN_PB13I_SDHC0_SDWP                       _UINT32_(45)
#define MUX_PB13I_SDHC0_SDWP                       _UINT32_(8) 
#define PINMUX_PB13I_SDHC0_SDWP                    ((PIN_PB13I_SDHC0_SDWP << 16) | MUX_PB13I_SDHC0_SDWP)
#define PORT_PB13I_SDHC0_SDWP                      (_UINT32_(1) << 13)

#define PIN_PC07I_SDHC0_SDWP                       _UINT32_(71)
#define MUX_PC07I_SDHC0_SDWP                       _UINT32_(8) 
#define PINMUX_PC07I_SDHC0_SDWP                    ((PIN_PC07I_SDHC0_SDWP << 16) | MUX_PC07I_SDHC0_SDWP)
#define PORT_PC07I_SDHC0_SDWP                      (_UINT32_(1) << 7)

/* ================== PORT definition for SDHC1 peripheral ================== */
#define PIN_PB16I_SDHC1_SDCD                       _UINT32_(48)
#define MUX_PB16I_SDHC1_SDCD                       _UINT32_(8) 
#define PINMUX_PB16I_SDHC1_SDCD                    ((PIN_PB16I_SDHC1_SDCD << 16) | MUX_PB16I_SDHC1_SDCD)
#define PORT_PB16I_SDHC1_SDCD                      (_UINT32_(1) << 16)

#define PIN_PA21I_SDHC1_SDCK                       _UINT32_(21)
#define MUX_PA21I_SDHC1_SDCK                       _UINT32_(8) 
#define PINMUX_PA21I_SDHC1_SDCK                    ((PIN_PA21I_SDHC1_SDCK << 16) | MUX_PA21I_SDHC1_SDCK)
#define PORT_PA21I_SDHC1_SDCK                      (_UINT32_(1) << 21)

#define PIN_PA20I_SDHC1_SDCMD                      _UINT32_(20)
#define MUX_PA20I_SDHC1_SDCMD                      _UINT32_(8) 
#define PINMUX_PA20I_SDHC1_SDCMD                   ((PIN_PA20I_SDHC1_SDCMD << 16) | MUX_PA20I_SDHC1_SDCMD)
#define PORT_PA20I_SDHC1_SDCMD                     (_UINT32_(1) << 20)

#define PIN_PB18I_SDHC1_SDDAT0                     _UINT32_(50)
#define MUX_PB18I_SDHC1_SDDAT0                     _UINT32_(8) 
#define PINMUX_PB18I_SDHC1_SDDAT0                  ((PIN_PB18I_SDHC1_SDDAT0 << 16) | MUX_PB18I_SDHC1_SDDAT0)
#define PORT_PB18I_SDHC1_SDDAT0                    (_UINT32_(1) << 18)

#define PIN_PB19I_SDHC1_SDDAT1                     _UINT32_(51)
#define MUX_PB19I_SDHC1_SDDAT1                     _UINT32_(8) 
#define PINMUX_PB19I_SDHC1_SDDAT1                  ((PIN_PB19I_SDHC1_SDDAT1 << 16) | MUX_PB19I_SDHC1_SDDAT1)
#define PORT_PB19I_SDHC1_SDDAT1                    (_UINT32_(1) << 19)

#define PIN_PB20I_SDHC1_SDDAT2                     _UINT32_(52)
#define MUX_PB20I_SDHC1_SDDAT2                     _UINT32_(8) 
#define PINMUX_PB20I_SDHC1_SDDAT2                  ((PIN_PB20I_SDHC1_SDDAT2 << 16) | MUX_PB20I_SDHC1_SDDAT2)
#define PORT_PB20I_SDHC1_SDDAT2                    (_UINT32_(1) << 20)

#define PIN_PB21I_SDHC1_SDDAT3                     _UINT32_(53)
#define MUX_PB21I_SDHC1_SDDAT3                     _UINT32_(8) 
#define PINMUX_PB21I_SDHC1_SDDAT3                  ((PIN_PB21I_SDHC1_SDDAT3 << 16) | MUX_PB21I_SDHC1_SDDAT3)
#define PORT_PB21I_SDHC1_SDDAT3                    (_UINT32_(1) << 21)

#define PIN_PB17I_SDHC1_SDWP                       _UINT32_(49)
#define MUX_PB17I_SDHC1_SDWP                       _UINT32_(8) 
#define PINMUX_PB17I_SDHC1_SDWP                    ((PIN_PB17I_SDHC1_SDWP << 16) | MUX_PB17I_SDHC1_SDWP)
#define PORT_PB17I_SDHC1_SDWP                      (_UINT32_(1) << 17)

/* ================= PORT definition for SERCOM0 peripheral ================= */
#define PIN_PA04D_SERCOM0_PAD0                     _UINT32_(4) 
#define MUX_PA04D_SERCOM0_PAD0                     _UINT32_(3) 
#define PINMUX_PA04D_SERCOM0_PAD0                  ((PIN_PA04D_SERCOM0_PAD0 << 16) | MUX_PA04D_SERCOM0_PAD0)
#define PORT_PA04D_SERCOM0_PAD0                    (_UINT32_(1) << 4)

#define PIN_PC17D_SERCOM0_PAD0                     _UINT32_(81)
#define MUX_PC17D_SERCOM0_PAD0                     _UINT32_(3) 
#define PINMUX_PC17D_SERCOM0_PAD0                  ((PIN_PC17D_SERCOM0_PAD0 << 16) | MUX_PC17D_SERCOM0_PAD0)
#define PORT_PC17D_SERCOM0_PAD0                    (_UINT32_(1) << 17)

#define PIN_PA08C_SERCOM0_PAD0                     _UINT32_(8) 
#define MUX_PA08C_SERCOM0_PAD0                     _UINT32_(2) 
#define PINMUX_PA08C_SERCOM0_PAD0                  ((PIN_PA08C_SERCOM0_PAD0 << 16) | MUX_PA08C_SERCOM0_PAD0)
#define PORT_PA08C_SERCOM0_PAD0                    (_UINT32_(1) << 8)

#define PIN_PA05D_SERCOM0_PAD1                     _UINT32_(5) 
#define MUX_PA05D_SERCOM0_PAD1                     _UINT32_(3) 
#define PINMUX_PA05D_SERCOM0_PAD1                  ((PIN_PA05D_SERCOM0_PAD1 << 16) | MUX_PA05D_SERCOM0_PAD1)
#define PORT_PA05D_SERCOM0_PAD1                    (_UINT32_(1) << 5)

#define PIN_PC16D_SERCOM0_PAD1                     _UINT32_(80)
#define MUX_PC16D_SERCOM0_PAD1                     _UINT32_(3) 
#define PINMUX_PC16D_SERCOM0_PAD1                  ((PIN_PC16D_SERCOM0_PAD1 << 16) | MUX_PC16D_SERCOM0_PAD1)
#define PORT_PC16D_SERCOM0_PAD1                    (_UINT32_(1) << 16)

