zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_sg/pic32cx_sg41/include/pio/pic32cx1025sg41080.h
/* =================== PORT definition for TC1 peripheral =================== */
#define PIN_PA06E_TC1_WO0                          _UINT32_(6) 
#define MUX_PA06E_TC1_WO0                          _UINT32_(4) 
#define PINMUX_PA06E_TC1_WO0                       ((PIN_PA06E_TC1_WO0 << 16) | MUX_PA06E_TC1_WO0)
#define PORT_PA06E_TC1_WO0                         (_UINT32_(1) << 6)

#define PIN_PA10E_TC1_WO0                          _UINT32_(10)
#define MUX_PA10E_TC1_WO0                          _UINT32_(4) 
#define PINMUX_PA10E_TC1_WO0                       ((PIN_PA10E_TC1_WO0 << 16) | MUX_PA10E_TC1_WO0)
#define PORT_PA10E_TC1_WO0                         (_UINT32_(1) << 10)

#define PIN_PA07E_TC1_WO1                          _UINT32_(7) 
#define MUX_PA07E_TC1_WO1                          _UINT32_(4) 
#define PINMUX_PA07E_TC1_WO1                       ((PIN_PA07E_TC1_WO1 << 16) | MUX_PA07E_TC1_WO1)
#define PORT_PA07E_TC1_WO1                         (_UINT32_(1) << 7)

#define PIN_PA11E_TC1_WO1                          _UINT32_(11)
#define MUX_PA11E_TC1_WO1                          _UINT32_(4) 
#define PINMUX_PA11E_TC1_WO1                       ((PIN_PA11E_TC1_WO1 << 16) | MUX_PA11E_TC1_WO1)
#define PORT_PA11E_TC1_WO1                         (_UINT32_(1) << 11)

/* =================== PORT definition for TC2 peripheral =================== */
#define PIN_PA12E_TC2_WO0                          _UINT32_(12)
#define MUX_PA12E_TC2_WO0                          _UINT32_(4) 
#define PINMUX_PA12E_TC2_WO0                       ((PIN_PA12E_TC2_WO0 << 16) | MUX_PA12E_TC2_WO0)
#define PORT_PA12E_TC2_WO0                         (_UINT32_(1) << 12)

#define PIN_PA16E_TC2_WO0                          _UINT32_(16)
#define MUX_PA16E_TC2_WO0                          _UINT32_(4) 
#define PINMUX_PA16E_TC2_WO0                       ((PIN_PA16E_TC2_WO0 << 16) | MUX_PA16E_TC2_WO0)
#define PORT_PA16E_TC2_WO0                         (_UINT32_(1) << 16)

#define PIN_PA00E_TC2_WO0                          _UINT32_(0) 
#define MUX_PA00E_TC2_WO0                          _UINT32_(4) 
#define PINMUX_PA00E_TC2_WO0                       ((PIN_PA00E_TC2_WO0 << 16) | MUX_PA00E_TC2_WO0)
#define PORT_PA00E_TC2_WO0                         (_UINT32_(1) << 0)

#define PIN_PA01E_TC2_WO1                          _UINT32_(1) 
#define MUX_PA01E_TC2_WO1                          _UINT32_(4) 
#define PINMUX_PA01E_TC2_WO1                       ((PIN_PA01E_TC2_WO1 << 16) | MUX_PA01E_TC2_WO1)
#define PORT_PA01E_TC2_WO1                         (_UINT32_(1) << 1)

#define PIN_PA13E_TC2_WO1                          _UINT32_(13)
#define MUX_PA13E_TC2_WO1                          _UINT32_(4) 
#define PINMUX_PA13E_TC2_WO1                       ((PIN_PA13E_TC2_WO1 << 16) | MUX_PA13E_TC2_WO1)
#define PORT_PA13E_TC2_WO1                         (_UINT32_(1) << 13)

#define PIN_PA17E_TC2_WO1                          _UINT32_(17)
#define MUX_PA17E_TC2_WO1                          _UINT32_(4) 
#define PINMUX_PA17E_TC2_WO1                       ((PIN_PA17E_TC2_WO1 << 16) | MUX_PA17E_TC2_WO1)
#define PORT_PA17E_TC2_WO1                         (_UINT32_(1) << 17)

/* =================== PORT definition for TC3 peripheral =================== */
#define PIN_PA18E_TC3_WO0                          _UINT32_(18)
#define MUX_PA18E_TC3_WO0                          _UINT32_(4) 
#define PINMUX_PA18E_TC3_WO0                       ((PIN_PA18E_TC3_WO0 << 16) | MUX_PA18E_TC3_WO0)
#define PORT_PA18E_TC3_WO0                         (_UINT32_(1) << 18)

#define PIN_PA14E_TC3_WO0                          _UINT32_(14)
#define MUX_PA14E_TC3_WO0                          _UINT32_(4) 
#define PINMUX_PA14E_TC3_WO0                       ((PIN_PA14E_TC3_WO0 << 16) | MUX_PA14E_TC3_WO0)
#define PORT_PA14E_TC3_WO0                         (_UINT32_(1) << 14)

#define PIN_PA15E_TC3_WO1                          _UINT32_(15)
#define MUX_PA15E_TC3_WO1                          _UINT32_(4) 
#define PINMUX_PA15E_TC3_WO1                       ((PIN_PA15E_TC3_WO1 << 16) | MUX_PA15E_TC3_WO1)
#define PORT_PA15E_TC3_WO1                         (_UINT32_(1) << 15)

#define PIN_PA19E_TC3_WO1                          _UINT32_(19)
#define MUX_PA19E_TC3_WO1                          _UINT32_(4) 
#define PINMUX_PA19E_TC3_WO1                       ((PIN_PA19E_TC3_WO1 << 16) | MUX_PA19E_TC3_WO1)
#define PORT_PA19E_TC3_WO1                         (_UINT32_(1) << 19)

/* =================== PORT definition for TC4 peripheral =================== */
#define PIN_PA22E_TC4_WO0                          _UINT32_(22)
#define MUX_PA22E_TC4_WO0                          _UINT32_(4) 
#define PINMUX_PA22E_TC4_WO0                       ((PIN_PA22E_TC4_WO0 << 16) | MUX_PA22E_TC4_WO0)
#define PORT_PA22E_TC4_WO0                         (_UINT32_(1) << 22)

#define PIN_PB08E_TC4_WO0                          _UINT32_(40)
#define MUX_PB08E_TC4_WO0                          _UINT32_(4) 
#define PINMUX_PB08E_TC4_WO0                       ((PIN_PB08E_TC4_WO0 << 16) | MUX_PB08E_TC4_WO0)
#define PORT_PB08E_TC4_WO0                         (_UINT32_(1) << 8)

#define PIN_PB12E_TC4_WO0                          _UINT32_(44)
#define MUX_PB12E_TC4_WO0                          _UINT32_(4) 
#define PINMUX_PB12E_TC4_WO0                       ((PIN_PB12E_TC4_WO0 << 16) | MUX_PB12E_TC4_WO0)
#define PORT_PB12E_TC4_WO0                         (_UINT32_(1) << 12)

#define PIN_PA23E_TC4_WO1                          _UINT32_(23)
#define MUX_PA23E_TC4_WO1                          _UINT32_(4) 
#define PINMUX_PA23E_TC4_WO1                       ((PIN_PA23E_TC4_WO1 << 16) | MUX_PA23E_TC4_WO1)
#define PORT_PA23E_TC4_WO1                         (_UINT32_(1) << 23)

#define PIN_PB09E_TC4_WO1                          _UINT32_(41)
#define MUX_PB09E_TC4_WO1                          _UINT32_(4) 
#define PINMUX_PB09E_TC4_WO1                       ((PIN_PB09E_TC4_WO1 << 16) | MUX_PB09E_TC4_WO1)
#define PORT_PB09E_TC4_WO1                         (_UINT32_(1) << 9)

#define PIN_PB13E_TC4_WO1                          _UINT32_(45)
#define MUX_PB13E_TC4_WO1                          _UINT32_(4) 
#define PINMUX_PB13E_TC4_WO1                       ((PIN_PB13E_TC4_WO1 << 16) | MUX_PB13E_TC4_WO1)
#define PORT_PB13E_TC4_WO1                         (_UINT32_(1) << 13)

/* =================== PORT definition for TC5 peripheral =================== */
#define PIN_PA24E_TC5_WO0                          _UINT32_(24)
#define MUX_PA24E_TC5_WO0                          _UINT32_(4) 
#define PINMUX_PA24E_TC5_WO0                       ((PIN_PA24E_TC5_WO0 << 16) | MUX_PA24E_TC5_WO0)
#define PORT_PA24E_TC5_WO0                         (_UINT32_(1) << 24)

#define PIN_PB10E_TC5_WO0                          _UINT32_(42)
#define MUX_PB10E_TC5_WO0                          _UINT32_(4) 
#define PINMUX_PB10E_TC5_WO0                       ((PIN_PB10E_TC5_WO0 << 16) | MUX_PB10E_TC5_WO0)
#define PORT_PB10E_TC5_WO0                         (_UINT32_(1) << 10)

#define PIN_PB14E_TC5_WO0                          _UINT32_(46)
#define MUX_PB14E_TC5_WO0                          _UINT32_(4) 
#define PINMUX_PB14E_TC5_WO0                       ((PIN_PB14E_TC5_WO0 << 16) | MUX_PB14E_TC5_WO0)
#define PORT_PB14E_TC5_WO0                         (_UINT32_(1) << 14)

#define PIN_PA25E_TC5_WO1                          _UINT32_(25)
#define MUX_PA25E_TC5_WO1                          _UINT32_(4) 
#define PINMUX_PA25E_TC5_WO1                       ((PIN_PA25E_TC5_WO1 << 16) | MUX_PA25E_TC5_WO1)
#define PORT_PA25E_TC5_WO1                         (_UINT32_(1) << 25)

#define PIN_PB11E_TC5_WO1                          _UINT32_(43)
#define MUX_PB11E_TC5_WO1                          _UINT32_(4) 
#define PINMUX_PB11E_TC5_WO1                       ((PIN_PB11E_TC5_WO1 << 16) | MUX_PB11E_TC5_WO1)
#define PORT_PB11E_TC5_WO1                         (_UINT32_(1) << 11)

#define PIN_PB15E_TC5_WO1                          _UINT32_(47)
#define MUX_PB15E_TC5_WO1                          _UINT32_(4) 
#define PINMUX_PB15E_TC5_WO1                       ((PIN_PB15E_TC5_WO1 << 16) | MUX_PB15E_TC5_WO1)
#define PORT_PB15E_TC5_WO1                         (_UINT32_(1) << 15)

/* =================== PORT definition for TC6 peripheral =================== */
#define PIN_PA30E_TC6_WO0                          _UINT32_(30)
#define MUX_PA30E_TC6_WO0                          _UINT32_(4) 
#define PINMUX_PA30E_TC6_WO0                       ((PIN_PA30E_TC6_WO0 << 16) | MUX_PA30E_TC6_WO0)
#define PORT_PA30E_TC6_WO0                         (_UINT32_(1) << 30)

