zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_sg/pic32cx_sg41/include/pio/pic32cx1025sg41080.h
#define PIN_PC12F_TCC0_WO2                         _UINT32_(76)
#define MUX_PC12F_TCC0_WO2                         _UINT32_(5) 
#define PINMUX_PC12F_TCC0_WO2                      ((PIN_PC12F_TCC0_WO2 << 16) | MUX_PC12F_TCC0_WO2)
#define PORT_PC12F_TCC0_WO2                        (_UINT32_(1) << 12)

#define PIN_PA23G_TCC0_WO3                         _UINT32_(23)
#define MUX_PA23G_TCC0_WO3                         _UINT32_(6) 
#define PINMUX_PA23G_TCC0_WO3                      ((PIN_PA23G_TCC0_WO3 << 16) | MUX_PA23G_TCC0_WO3)
#define PORT_PA23G_TCC0_WO3                        (_UINT32_(1) << 23)

#define PIN_PB15G_TCC0_WO3                         _UINT32_(47)
#define MUX_PB15G_TCC0_WO3                         _UINT32_(6) 
#define PINMUX_PB15G_TCC0_WO3                      ((PIN_PB15G_TCC0_WO3 << 16) | MUX_PB15G_TCC0_WO3)
#define PORT_PB15G_TCC0_WO3                        (_UINT32_(1) << 15)

#define PIN_PA11F_TCC0_WO3                         _UINT32_(11)
#define MUX_PA11F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PA11F_TCC0_WO3                      ((PIN_PA11F_TCC0_WO3 << 16) | MUX_PA11F_TCC0_WO3)
#define PORT_PA11F_TCC0_WO3                        (_UINT32_(1) << 11)

#define PIN_PC13F_TCC0_WO3                         _UINT32_(77)
#define MUX_PC13F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PC13F_TCC0_WO3                      ((PIN_PC13F_TCC0_WO3 << 16) | MUX_PC13F_TCC0_WO3)
#define PORT_PC13F_TCC0_WO3                        (_UINT32_(1) << 13)

#define PIN_PA16G_TCC0_WO4                         _UINT32_(16)
#define MUX_PA16G_TCC0_WO4                         _UINT32_(6) 
#define PINMUX_PA16G_TCC0_WO4                      ((PIN_PA16G_TCC0_WO4 << 16) | MUX_PA16G_TCC0_WO4)
#define PORT_PA16G_TCC0_WO4                        (_UINT32_(1) << 16)

#define PIN_PB16G_TCC0_WO4                         _UINT32_(48)
#define MUX_PB16G_TCC0_WO4                         _UINT32_(6) 
#define PINMUX_PB16G_TCC0_WO4                      ((PIN_PB16G_TCC0_WO4 << 16) | MUX_PB16G_TCC0_WO4)
#define PORT_PB16G_TCC0_WO4                        (_UINT32_(1) << 16)

#define PIN_PB10F_TCC0_WO4                         _UINT32_(42)
#define MUX_PB10F_TCC0_WO4                         _UINT32_(5) 
#define PINMUX_PB10F_TCC0_WO4                      ((PIN_PB10F_TCC0_WO4 << 16) | MUX_PB10F_TCC0_WO4)
#define PORT_PB10F_TCC0_WO4                        (_UINT32_(1) << 10)

#define PIN_PC14F_TCC0_WO4                         _UINT32_(78)
#define MUX_PC14F_TCC0_WO4                         _UINT32_(5) 
#define PINMUX_PC14F_TCC0_WO4                      ((PIN_PC14F_TCC0_WO4 << 16) | MUX_PC14F_TCC0_WO4)
#define PORT_PC14F_TCC0_WO4                        (_UINT32_(1) << 14)

#define PIN_PA17G_TCC0_WO5                         _UINT32_(17)
#define MUX_PA17G_TCC0_WO5                         _UINT32_(6) 
#define PINMUX_PA17G_TCC0_WO5                      ((PIN_PA17G_TCC0_WO5 << 16) | MUX_PA17G_TCC0_WO5)
#define PORT_PA17G_TCC0_WO5                        (_UINT32_(1) << 17)

#define PIN_PB17G_TCC0_WO5                         _UINT32_(49)
#define MUX_PB17G_TCC0_WO5                         _UINT32_(6) 
#define PINMUX_PB17G_TCC0_WO5                      ((PIN_PB17G_TCC0_WO5 << 16) | MUX_PB17G_TCC0_WO5)
#define PORT_PB17G_TCC0_WO5                        (_UINT32_(1) << 17)

#define PIN_PB11F_TCC0_WO5                         _UINT32_(43)
#define MUX_PB11F_TCC0_WO5                         _UINT32_(5) 
#define PINMUX_PB11F_TCC0_WO5                      ((PIN_PB11F_TCC0_WO5 << 16) | MUX_PB11F_TCC0_WO5)
#define PORT_PB11F_TCC0_WO5                        (_UINT32_(1) << 11)

#define PIN_PC15F_TCC0_WO5                         _UINT32_(79)
#define MUX_PC15F_TCC0_WO5                         _UINT32_(5) 
#define PINMUX_PC15F_TCC0_WO5                      ((PIN_PC15F_TCC0_WO5 << 16) | MUX_PC15F_TCC0_WO5)
#define PORT_PC15F_TCC0_WO5                        (_UINT32_(1) << 15)

#define PIN_PA18G_TCC0_WO6                         _UINT32_(18)
#define MUX_PA18G_TCC0_WO6                         _UINT32_(6) 
#define PINMUX_PA18G_TCC0_WO6                      ((PIN_PA18G_TCC0_WO6 << 16) | MUX_PA18G_TCC0_WO6)
#define PORT_PA18G_TCC0_WO6                        (_UINT32_(1) << 18)

#define PIN_PB30G_TCC0_WO6                         _UINT32_(62)
#define MUX_PB30G_TCC0_WO6                         _UINT32_(6) 
#define PINMUX_PB30G_TCC0_WO6                      ((PIN_PB30G_TCC0_WO6 << 16) | MUX_PB30G_TCC0_WO6)
#define PORT_PB30G_TCC0_WO6                        (_UINT32_(1) << 30)

#define PIN_PA12F_TCC0_WO6                         _UINT32_(12)
#define MUX_PA12F_TCC0_WO6                         _UINT32_(5) 
#define PINMUX_PA12F_TCC0_WO6                      ((PIN_PA12F_TCC0_WO6 << 16) | MUX_PA12F_TCC0_WO6)
#define PORT_PA12F_TCC0_WO6                        (_UINT32_(1) << 12)

#define PIN_PA19G_TCC0_WO7                         _UINT32_(19)
#define MUX_PA19G_TCC0_WO7                         _UINT32_(6) 
#define PINMUX_PA19G_TCC0_WO7                      ((PIN_PA19G_TCC0_WO7 << 16) | MUX_PA19G_TCC0_WO7)
#define PORT_PA19G_TCC0_WO7                        (_UINT32_(1) << 19)

#define PIN_PB31G_TCC0_WO7                         _UINT32_(63)
#define MUX_PB31G_TCC0_WO7                         _UINT32_(6) 
#define PINMUX_PB31G_TCC0_WO7                      ((PIN_PB31G_TCC0_WO7 << 16) | MUX_PB31G_TCC0_WO7)
#define PORT_PB31G_TCC0_WO7                        (_UINT32_(1) << 31)

#define PIN_PA13F_TCC0_WO7                         _UINT32_(13)
#define MUX_PA13F_TCC0_WO7                         _UINT32_(5) 
#define PINMUX_PA13F_TCC0_WO7                      ((PIN_PA13F_TCC0_WO7 << 16) | MUX_PA13F_TCC0_WO7)
#define PORT_PA13F_TCC0_WO7                        (_UINT32_(1) << 13)

/* ================== PORT definition for TCC1 peripheral =================== */
#define PIN_PB10G_TCC1_WO0                         _UINT32_(42)
#define MUX_PB10G_TCC1_WO0                         _UINT32_(6) 
#define PINMUX_PB10G_TCC1_WO0                      ((PIN_PB10G_TCC1_WO0 << 16) | MUX_PB10G_TCC1_WO0)
#define PORT_PB10G_TCC1_WO0                        (_UINT32_(1) << 10)

