zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_sg/pic32cx_sg41/include/pio/pic32cx1025sg41080.h
#define PIN_PC14G_TCC1_WO0                         _UINT32_(78)
#define MUX_PC14G_TCC1_WO0                         _UINT32_(6) 
#define PINMUX_PC14G_TCC1_WO0                      ((PIN_PC14G_TCC1_WO0 << 16) | MUX_PC14G_TCC1_WO0)
#define PORT_PC14G_TCC1_WO0                        (_UINT32_(1) << 14)

#define PIN_PA16F_TCC1_WO0                         _UINT32_(16)
#define MUX_PA16F_TCC1_WO0                         _UINT32_(5) 
#define PINMUX_PA16F_TCC1_WO0                      ((PIN_PA16F_TCC1_WO0 << 16) | MUX_PA16F_TCC1_WO0)
#define PORT_PA16F_TCC1_WO0                        (_UINT32_(1) << 16)

#define PIN_PB18F_TCC1_WO0                         _UINT32_(50)
#define MUX_PB18F_TCC1_WO0                         _UINT32_(5) 
#define PINMUX_PB18F_TCC1_WO0                      ((PIN_PB18F_TCC1_WO0 << 16) | MUX_PB18F_TCC1_WO0)
#define PORT_PB18F_TCC1_WO0                        (_UINT32_(1) << 18)

#define PIN_PB11G_TCC1_WO1                         _UINT32_(43)
#define MUX_PB11G_TCC1_WO1                         _UINT32_(6) 
#define PINMUX_PB11G_TCC1_WO1                      ((PIN_PB11G_TCC1_WO1 << 16) | MUX_PB11G_TCC1_WO1)
#define PORT_PB11G_TCC1_WO1                        (_UINT32_(1) << 11)

#define PIN_PC15G_TCC1_WO1                         _UINT32_(79)
#define MUX_PC15G_TCC1_WO1                         _UINT32_(6) 
#define PINMUX_PC15G_TCC1_WO1                      ((PIN_PC15G_TCC1_WO1 << 16) | MUX_PC15G_TCC1_WO1)
#define PORT_PC15G_TCC1_WO1                        (_UINT32_(1) << 15)

#define PIN_PA17F_TCC1_WO1                         _UINT32_(17)
#define MUX_PA17F_TCC1_WO1                         _UINT32_(5) 
#define PINMUX_PA17F_TCC1_WO1                      ((PIN_PA17F_TCC1_WO1 << 16) | MUX_PA17F_TCC1_WO1)
#define PORT_PA17F_TCC1_WO1                        (_UINT32_(1) << 17)

#define PIN_PB19F_TCC1_WO1                         _UINT32_(51)
#define MUX_PB19F_TCC1_WO1                         _UINT32_(5) 
#define PINMUX_PB19F_TCC1_WO1                      ((PIN_PB19F_TCC1_WO1 << 16) | MUX_PB19F_TCC1_WO1)
#define PORT_PB19F_TCC1_WO1                        (_UINT32_(1) << 19)

#define PIN_PA12G_TCC1_WO2                         _UINT32_(12)
#define MUX_PA12G_TCC1_WO2                         _UINT32_(6) 
#define PINMUX_PA12G_TCC1_WO2                      ((PIN_PA12G_TCC1_WO2 << 16) | MUX_PA12G_TCC1_WO2)
#define PORT_PA12G_TCC1_WO2                        (_UINT32_(1) << 12)

#define PIN_PA14G_TCC1_WO2                         _UINT32_(14)
#define MUX_PA14G_TCC1_WO2                         _UINT32_(6) 
#define PINMUX_PA14G_TCC1_WO2                      ((PIN_PA14G_TCC1_WO2 << 16) | MUX_PA14G_TCC1_WO2)
#define PORT_PA14G_TCC1_WO2                        (_UINT32_(1) << 14)

#define PIN_PA18F_TCC1_WO2                         _UINT32_(18)
#define MUX_PA18F_TCC1_WO2                         _UINT32_(5) 
#define PINMUX_PA18F_TCC1_WO2                      ((PIN_PA18F_TCC1_WO2 << 16) | MUX_PA18F_TCC1_WO2)
#define PORT_PA18F_TCC1_WO2                        (_UINT32_(1) << 18)

#define PIN_PB20F_TCC1_WO2                         _UINT32_(52)
#define MUX_PB20F_TCC1_WO2                         _UINT32_(5) 
#define PINMUX_PB20F_TCC1_WO2                      ((PIN_PB20F_TCC1_WO2 << 16) | MUX_PB20F_TCC1_WO2)
#define PORT_PB20F_TCC1_WO2                        (_UINT32_(1) << 20)

#define PIN_PA13G_TCC1_WO3                         _UINT32_(13)
#define MUX_PA13G_TCC1_WO3                         _UINT32_(6) 
#define PINMUX_PA13G_TCC1_WO3                      ((PIN_PA13G_TCC1_WO3 << 16) | MUX_PA13G_TCC1_WO3)
#define PORT_PA13G_TCC1_WO3                        (_UINT32_(1) << 13)

#define PIN_PA15G_TCC1_WO3                         _UINT32_(15)
#define MUX_PA15G_TCC1_WO3                         _UINT32_(6) 
#define PINMUX_PA15G_TCC1_WO3                      ((PIN_PA15G_TCC1_WO3 << 16) | MUX_PA15G_TCC1_WO3)
#define PORT_PA15G_TCC1_WO3                        (_UINT32_(1) << 15)

#define PIN_PA19F_TCC1_WO3                         _UINT32_(19)
#define MUX_PA19F_TCC1_WO3                         _UINT32_(5) 
#define PINMUX_PA19F_TCC1_WO3                      ((PIN_PA19F_TCC1_WO3 << 16) | MUX_PA19F_TCC1_WO3)
#define PORT_PA19F_TCC1_WO3                        (_UINT32_(1) << 19)

#define PIN_PB21F_TCC1_WO3                         _UINT32_(53)
#define MUX_PB21F_TCC1_WO3                         _UINT32_(5) 
#define PINMUX_PB21F_TCC1_WO3                      ((PIN_PB21F_TCC1_WO3 << 16) | MUX_PB21F_TCC1_WO3)
#define PORT_PB21F_TCC1_WO3                        (_UINT32_(1) << 21)

#define PIN_PA08G_TCC1_WO4                         _UINT32_(8) 
#define MUX_PA08G_TCC1_WO4                         _UINT32_(6) 
#define PINMUX_PA08G_TCC1_WO4                      ((PIN_PA08G_TCC1_WO4 << 16) | MUX_PA08G_TCC1_WO4)
#define PORT_PA08G_TCC1_WO4                        (_UINT32_(1) << 8)

#define PIN_PA20F_TCC1_WO4                         _UINT32_(20)
#define MUX_PA20F_TCC1_WO4                         _UINT32_(5) 
#define PINMUX_PA20F_TCC1_WO4                      ((PIN_PA20F_TCC1_WO4 << 16) | MUX_PA20F_TCC1_WO4)
#define PORT_PA20F_TCC1_WO4                        (_UINT32_(1) << 20)

#define PIN_PA09G_TCC1_WO5                         _UINT32_(9) 
#define MUX_PA09G_TCC1_WO5                         _UINT32_(6) 
#define PINMUX_PA09G_TCC1_WO5                      ((PIN_PA09G_TCC1_WO5 << 16) | MUX_PA09G_TCC1_WO5)
#define PORT_PA09G_TCC1_WO5                        (_UINT32_(1) << 9)

#define PIN_PA21F_TCC1_WO5                         _UINT32_(21)
#define MUX_PA21F_TCC1_WO5                         _UINT32_(5) 
#define PINMUX_PA21F_TCC1_WO5                      ((PIN_PA21F_TCC1_WO5 << 16) | MUX_PA21F_TCC1_WO5)
#define PORT_PA21F_TCC1_WO5                        (_UINT32_(1) << 21)

#define PIN_PA10G_TCC1_WO6                         _UINT32_(10)
#define MUX_PA10G_TCC1_WO6                         _UINT32_(6) 
#define PINMUX_PA10G_TCC1_WO6                      ((PIN_PA10G_TCC1_WO6 << 16) | MUX_PA10G_TCC1_WO6)
#define PORT_PA10G_TCC1_WO6                        (_UINT32_(1) << 10)

