zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_sg/pic32cx_sg41/include/pio/pic32cx1025sg41080.h
#define PIN_PC12G_TCC1_WO6                         _UINT32_(76)
#define MUX_PC12G_TCC1_WO6                         _UINT32_(6) 
#define PINMUX_PC12G_TCC1_WO6                      ((PIN_PC12G_TCC1_WO6 << 16) | MUX_PC12G_TCC1_WO6)
#define PORT_PC12G_TCC1_WO6                        (_UINT32_(1) << 12)

#define PIN_PA22F_TCC1_WO6                         _UINT32_(22)
#define MUX_PA22F_TCC1_WO6                         _UINT32_(5) 
#define PINMUX_PA22F_TCC1_WO6                      ((PIN_PA22F_TCC1_WO6 << 16) | MUX_PA22F_TCC1_WO6)
#define PORT_PA22F_TCC1_WO6                        (_UINT32_(1) << 22)

#define PIN_PA11G_TCC1_WO7                         _UINT32_(11)
#define MUX_PA11G_TCC1_WO7                         _UINT32_(6) 
#define PINMUX_PA11G_TCC1_WO7                      ((PIN_PA11G_TCC1_WO7 << 16) | MUX_PA11G_TCC1_WO7)
#define PORT_PA11G_TCC1_WO7                        (_UINT32_(1) << 11)

#define PIN_PC13G_TCC1_WO7                         _UINT32_(77)
#define MUX_PC13G_TCC1_WO7                         _UINT32_(6) 
#define PINMUX_PC13G_TCC1_WO7                      ((PIN_PC13G_TCC1_WO7 << 16) | MUX_PC13G_TCC1_WO7)
#define PORT_PC13G_TCC1_WO7                        (_UINT32_(1) << 13)

#define PIN_PA23F_TCC1_WO7                         _UINT32_(23)
#define MUX_PA23F_TCC1_WO7                         _UINT32_(5) 
#define PINMUX_PA23F_TCC1_WO7                      ((PIN_PA23F_TCC1_WO7 << 16) | MUX_PA23F_TCC1_WO7)
#define PORT_PA23F_TCC1_WO7                        (_UINT32_(1) << 23)

/* ================== PORT definition for TCC2 peripheral =================== */
#define PIN_PA14F_TCC2_WO0                         _UINT32_(14)
#define MUX_PA14F_TCC2_WO0                         _UINT32_(5) 
#define PINMUX_PA14F_TCC2_WO0                      ((PIN_PA14F_TCC2_WO0 << 16) | MUX_PA14F_TCC2_WO0)
#define PORT_PA14F_TCC2_WO0                        (_UINT32_(1) << 14)

#define PIN_PA30F_TCC2_WO0                         _UINT32_(30)
#define MUX_PA30F_TCC2_WO0                         _UINT32_(5) 
#define PINMUX_PA30F_TCC2_WO0                      ((PIN_PA30F_TCC2_WO0 << 16) | MUX_PA30F_TCC2_WO0)
#define PORT_PA30F_TCC2_WO0                        (_UINT32_(1) << 30)

#define PIN_PA15F_TCC2_WO1                         _UINT32_(15)
#define MUX_PA15F_TCC2_WO1                         _UINT32_(5) 
#define PINMUX_PA15F_TCC2_WO1                      ((PIN_PA15F_TCC2_WO1 << 16) | MUX_PA15F_TCC2_WO1)
#define PORT_PA15F_TCC2_WO1                        (_UINT32_(1) << 15)

#define PIN_PA31F_TCC2_WO1                         _UINT32_(31)
#define MUX_PA31F_TCC2_WO1                         _UINT32_(5) 
#define PINMUX_PA31F_TCC2_WO1                      ((PIN_PA31F_TCC2_WO1 << 16) | MUX_PA31F_TCC2_WO1)
#define PORT_PA31F_TCC2_WO1                        (_UINT32_(1) << 31)

#define PIN_PA24F_TCC2_WO2                         _UINT32_(24)
#define MUX_PA24F_TCC2_WO2                         _UINT32_(5) 
#define PINMUX_PA24F_TCC2_WO2                      ((PIN_PA24F_TCC2_WO2 << 16) | MUX_PA24F_TCC2_WO2)
#define PORT_PA24F_TCC2_WO2                        (_UINT32_(1) << 24)

#define PIN_PB02F_TCC2_WO2                         _UINT32_(34)
#define MUX_PB02F_TCC2_WO2                         _UINT32_(5) 
#define PINMUX_PB02F_TCC2_WO2                      ((PIN_PB02F_TCC2_WO2 << 16) | MUX_PB02F_TCC2_WO2)
#define PORT_PB02F_TCC2_WO2                        (_UINT32_(1) << 2)

/* ================== PORT definition for TCC3 peripheral =================== */
#define PIN_PB12F_TCC3_WO0                         _UINT32_(44)
#define MUX_PB12F_TCC3_WO0                         _UINT32_(5) 
#define PINMUX_PB12F_TCC3_WO0                      ((PIN_PB12F_TCC3_WO0 << 16) | MUX_PB12F_TCC3_WO0)
#define PORT_PB12F_TCC3_WO0                        (_UINT32_(1) << 12)

#define PIN_PB16F_TCC3_WO0                         _UINT32_(48)
#define MUX_PB16F_TCC3_WO0                         _UINT32_(5) 
#define PINMUX_PB16F_TCC3_WO0                      ((PIN_PB16F_TCC3_WO0 << 16) | MUX_PB16F_TCC3_WO0)
#define PORT_PB16F_TCC3_WO0                        (_UINT32_(1) << 16)

#define PIN_PB13F_TCC3_WO1                         _UINT32_(45)
#define MUX_PB13F_TCC3_WO1                         _UINT32_(5) 
#define PINMUX_PB13F_TCC3_WO1                      ((PIN_PB13F_TCC3_WO1 << 16) | MUX_PB13F_TCC3_WO1)
#define PORT_PB13F_TCC3_WO1                        (_UINT32_(1) << 13)

#define PIN_PB17F_TCC3_WO1                         _UINT32_(49)
#define MUX_PB17F_TCC3_WO1                         _UINT32_(5) 
#define PINMUX_PB17F_TCC3_WO1                      ((PIN_PB17F_TCC3_WO1 << 16) | MUX_PB17F_TCC3_WO1)
#define PORT_PB17F_TCC3_WO1                        (_UINT32_(1) << 17)

/* ================== PORT definition for TCC4 peripheral =================== */
#define PIN_PB14F_TCC4_WO0                         _UINT32_(46)
#define MUX_PB14F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PB14F_TCC4_WO0                      ((PIN_PB14F_TCC4_WO0 << 16) | MUX_PB14F_TCC4_WO0)
#define PORT_PB14F_TCC4_WO0                        (_UINT32_(1) << 14)

#define PIN_PB30F_TCC4_WO0                         _UINT32_(62)
#define MUX_PB30F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PB30F_TCC4_WO0                      ((PIN_PB30F_TCC4_WO0 << 16) | MUX_PB30F_TCC4_WO0)
#define PORT_PB30F_TCC4_WO0                        (_UINT32_(1) << 30)

#define PIN_PB15F_TCC4_WO1                         _UINT32_(47)
#define MUX_PB15F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PB15F_TCC4_WO1                      ((PIN_PB15F_TCC4_WO1 << 16) | MUX_PB15F_TCC4_WO1)
#define PORT_PB15F_TCC4_WO1                        (_UINT32_(1) << 15)

#define PIN_PB31F_TCC4_WO1                         _UINT32_(63)
#define MUX_PB31F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PB31F_TCC4_WO1                      ((PIN_PB31F_TCC4_WO1 << 16) | MUX_PB31F_TCC4_WO1)
#define PORT_PB31F_TCC4_WO1                        (_UINT32_(1) << 31)

/* =================== PORT definition for USB peripheral =================== */
#define PIN_PA24H_USB_DM                           _UINT32_(24)
#define MUX_PA24H_USB_DM                           _UINT32_(7) 
#define PINMUX_PA24H_USB_DM                        ((PIN_PA24H_USB_DM << 16) | MUX_PA24H_USB_DM)
#define PORT_PA24H_USB_DM                          (_UINT32_(1) << 24)

#define PIN_PA25H_USB_DP                           _UINT32_(25)
#define MUX_PA25H_USB_DP                           _UINT32_(7) 
#define PINMUX_PA25H_USB_DP                        ((PIN_PA25H_USB_DP << 16) | MUX_PA25H_USB_DP)
#define PORT_PA25H_USB_DP                          (_UINT32_(1) << 25)

#define PIN_PA23H_USB_SOF_1KHZ                     _UINT32_(23)
#define MUX_PA23H_USB_SOF_1KHZ                     _UINT32_(7) 
#define PINMUX_PA23H_USB_SOF_1KHZ                  ((PIN_PA23H_USB_SOF_1KHZ << 16) | MUX_PA23H_USB_SOF_1KHZ)
#define PORT_PA23H_USB_SOF_1KHZ                    (_UINT32_(1) << 23)

#define PIN_PB22H_USB_SOF_1KHZ                     _UINT32_(54)
#define MUX_PB22H_USB_SOF_1KHZ                     _UINT32_(7) 
#define PINMUX_PB22H_USB_SOF_1KHZ                  ((PIN_PB22H_USB_SOF_1KHZ << 16) | MUX_PB22H_USB_SOF_1KHZ)
#define PORT_PB22H_USB_SOF_1KHZ                    (_UINT32_(1) << 22)

/* ================== PORT definition for TPIU peripheral =================== */
#define PIN_PC27H_TPIU_TRACECLK                    _UINT32_(91)
#define MUX_PC27H_TPIU_TRACECLK                    _UINT32_(7) 
#define PINMUX_PC27H_TPIU_TRACECLK                 ((PIN_PC27H_TPIU_TRACECLK << 16) | MUX_PC27H_TPIU_TRACECLK)
#define PORT_PC27H_TPIU_TRACECLK                   (_UINT32_(1) << 27)

#define PIN_PC28H_TPIU_TRACED0                     _UINT32_(92)
#define MUX_PC28H_TPIU_TRACED0                     _UINT32_(7) 
#define PINMUX_PC28H_TPIU_TRACED0                  ((PIN_PC28H_TPIU_TRACED0 << 16) | MUX_PC28H_TPIU_TRACED0)
#define PORT_PC28H_TPIU_TRACED0                    (_UINT32_(1) << 28)



#endif /* _PIC32CX1025SG41080_GPIO_H_ */

